# Этап 1: сборка
FROM golang:1.22-alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum для использования кеша слоев
COPY go.mod go.sum ./

# Загружаем зависимости
RUN go mod download

# Копируем исходный код приложения в контейнер
COPY . .

# Собираем Go-приложение
RUN go build -o main .

# Этап 2: создание минималистичного образа для выполнения
FROM alpine:latest

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /root/

# Копируем скомпилированный бинарный файл из предыдущего этапа
COPY --from=builder /app/main .

# Определяем команду, которая будет выполняться при запуске контейнера
CMD ["./main"]
